#import "ZJNotificationConst.h"

//** =========================================================================================== */
//** ===========================================public========================================== */
//** =========================================================================================== */

/**
 *  商品加入了喜欢
 */
NSString * const PUBLIC_GOODLISTCOLLECTION_NOTIFICATION                                             = @"PUBLIC_GOODLISTCOLLECTION_NOTIFICATION";

/**
 *  点击首页刷新
 */
NSString * const PUBLIC_REFRESHHOMEPAGE_NOTIFICATION                                                = @"PUBLIC_REFRESHHOMEPAGE_NOTIFICATION";

//** =========================================================================================== */
//** ==========================================GoodList========================================= */
//** =========================================================================================== */

/**
 *  商品列表条件筛选点击事件通知
 */
NSString * const GOODLIST_CONDITIONALSCREENING_CLICK_NOTIFICATION                                   = @"GOODLIST_CONDITIONALSCREENING_CLICK_NOTIFICATION";

//** =========================================================================================== */
//** ============================================Timer========================================== */
//** =========================================================================================== */

/**
 *  定时器调用方法通知
 */
NSString * const TIMER_NOTIFICATION                                                                 = @"TIMER_NOTIFICATION";

//** =========================================================================================== */
//** ============================================Order========================================== */
//** =========================================================================================== */

/**
 *  订单详情倒计时通知
 */
NSString * const ORDER_ORDERDETAIL_NOTIFICATION                                                     = @"ORDER_ORDERDETAIL_NOTIFICATION";

//** =========================================================================================== */
//** ==========================================compose========================================= */
//** =========================================================================================== */

/**
 *  发布-上传图片进度通知
 */
NSString * const COMPOSE_UPLOADIMAGE_PROGRESS_NOTIFICATION                                          = @"COMPOSE_UPLOADIMAGE_PROGRESS_NOTIFICATION";

/**
 *  发布-上传成功失败通知
 */
NSString * const COMPOSE_UPLOADIMAGE_ISSUCCESS_NOTIFICATION                                         = @"COMPOSE_UPLOADIMAGE_ISSUCCESS_NOTIFICATION";

/**
 *  发布列表倒计时
 */
NSString * const COMPOSE_LISTCOUNTDOWN_NOTIFICATION                                                 = @"COMPOSE_LISTCOUNTDOWN_NOTIFICATION";

//** =========================================================================================== */
//** ============================================pay=========================================== */
//** =========================================================================================== */

/**
 *  支付成功通知，用于修改商品状态
 */
NSString * const PAY_RESULT_SUCCESS_NOTIFICATION                                                    = @"PAY_RESULT_SUCCESS_NOTIFICATION";

